In [ ]:
#importing our libraries
import pandas as pd
import numpy as np

In [ ]:
#loading our dataset that desribes our columns of the geo locations dataset
df1 = pd.read_excel('sample_data/cells_geo_description.xlsx', sheet_name=0, header=0)
df1

     Column name                                        Description  Format
0         VILLES                                               City  String
1         STATUS                                  In Service or not  String
2   LOCALISATION                                  in ABIDJAN or not  String
3     DECOUPZONE                                  Geographical Zone  String
4       ZONENAME                                       Name of Zone  String
5      LONGITUDE                                          Longitude   Float
6       LATITUDE                                           Latitude   Float
7         REGION                                             Region  String
8           AREA                                               Area  String
9        CELL_ID                                     ID of the cell  String
10     SITE_CODE  Site (there are several cells per site, severa...  String

In [ ]:
#loading our geo location dataset
df2 = pd.read_csv('sample_data/cells_geo.csv', delimiter = ';')
df2.head(5)

   Unnamed: 0   VILLES      STATUS  ... AREA     CELL_ID   SITE_CODE
0           0   ADJAME  In Service  ...  NaN  fbb2e75af3  0bb492ef17
1           1   ADJAME  In Service  ...  NaN  1502501d78  0bb492ef17
2           2   ADJAME  In Service  ...  NaN  0c2e182a0c  0bb492ef17
3           3  ASSINIE  In Service  ...  NaN  69bdfc69fd  8a1e6ce31f
4           4  ASSINIE  In Service  ...  NaN  7a1029d2ab  8a1e6ce31f

[5 rows x 12 columns]

In [ ]:
#loading our descriptive dataset for the mobile usages dataset
df3 = pd.read_excel('sample_data/CDR_description.xlsx', sheet_name=0, header=0)
df3

       Column name                                        Description   Format
0          PRODUCT                                       Voice or SMS   String
1            VALUE                                      Billing price  Integer
2        DATE_TIME               Time in format yyyy-MM-dd hh:mm:ss.0   String
3     CELL_ON_SITE  Which cell in the site was used (not needed here)  Integer
4  DW_A_NUMBER_INT  Anonymized phone number of the person for whic...   String
5  DW_B_NUMBER_INT        Anonymized phone number of the counterparty   String
6        COUNTRY_A                  Country of party A (useless here)   String
7        COUNTRY_B                  Country of party B (useless here)   String
8          CELL_ID                                     ID of the cell   String
9          SITE_ID                                     ID of the SITE   String

In [ ]:
#loading datasets of the days' mobile usage(6th)
df4 = pd.read_csv('sample_data/Telcom_dataset.csv')
df4.head(5)

  PRODUTC  VALUE               DATETIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice      0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
2     sms     25  2012-05-06 23:05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi
3   Voice     56  2012-05-06 23:05:42.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     14  2012-05-06 23:06:29.0  ...     19e2e  051KhYDCpv  051KhYDCpv

[5 rows x 10 columns]

In [ ]:
#loading datasets of the days' mobile usage(7th)
df5 = pd.read_csv('sample_data/Telcom_dataset2.csv')
df5.head(5)

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0     sms      0  2012-05-07 23:02:06.0  ...     19e2e  +854AcBQT2  +854AcBQT2
1   Voice      0  2012-05-07 23:03:44.0  ...     19e2e  +854AcBQT2  +854AcBQT2
2     sms      0  2012-05-07 23:04:06.0  ...     19e2e  +laSrk7g6q  +laSrk7g6q
3   Voice     37  2012-05-07 23:04:48.0  ...     19e2e  /xvRrCVKoQ  /xvRrCVKoQ
4     sms     25  2012-05-07 23:04:58.0  ...     19e2e  +bO+qkSonO  +bO+qkSonO

[5 rows x 10 columns]

In [ ]:
#loading datasets of the days' mobile usage(8th)
df6 = pd.read_csv('sample_data/Telcom_dataset3.csv')
df6.head(5)

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B      CELLID     SIET_ID
0   Voice     61  2012-05-08 23:01:28.0  ...     19e2e  +38u2u/rfx  +38u2u/rfx
1     sms      0  2012-05-08 23:01:31.0  ...     19e2e  +Fs4mTvdKx  +Fs4mTvdKx
2   Voice     10  2012-05-08 23:02:59.0  ...     19e2e  +ZaaZozy/+  +ZaaZozy/+
3     sms      0  2012-05-08 23:03:04.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     22  2012-05-08 23:03:16.0  ...     19e2e  /eeMklgyJA  /eeMklgyJA

[5 rows x 10 columns]

In [ ]:
#Changing column names for uniformity
#df2.columns =[Unnamed: 0	VILLES	STATUS	LOCALISATION	DECOUPZONE	ZONENAME	LONGITUDE	LATITUDE	REGION	AREA	CELL_ID	SITE_CODE]
df4.columns =['PRODUCT','VALUE','DATE_TIME','CELL_ON_SITE','DW_A_NUMBER','DW_B_NUMBER','COUNTRY_A','COUNTRY_B','CELL_ID','SITE_ID']
df5.columns =['PRODUCT','VALUE','DATE_TIME','CELL_ON_SITE','DW_A_NUMBER','DW_B_NUMBER','COUNTRY_A','COUNTRY_B','CELL_ID','SITE_ID']
df6.columns =['PRODUCT','VALUE','DATE_TIME','CELL_ON_SITE','DW_A_NUMBER','DW_B_NUMBER','COUNTRY_A','COUNTRY_B','CELL_ID','SITE_ID']

In [ ]:
df4.head(5)

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice      0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
2     sms     25  2012-05-06 23:05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi
3   Voice     56  2012-05-06 23:05:42.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     14  2012-05-06 23:06:29.0  ...     19e2e  051KhYDCpv  051KhYDCpv

[5 rows x 10 columns]

In [ ]:
df5.head(5)

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0     sms      0  2012-05-07 23:02:06.0  ...     19e2e  +854AcBQT2  +854AcBQT2
1   Voice      0  2012-05-07 23:03:44.0  ...     19e2e  +854AcBQT2  +854AcBQT2
2     sms      0  2012-05-07 23:04:06.0  ...     19e2e  +laSrk7g6q  +laSrk7g6q
3   Voice     37  2012-05-07 23:04:48.0  ...     19e2e  /xvRrCVKoQ  /xvRrCVKoQ
4     sms     25  2012-05-07 23:04:58.0  ...     19e2e  +bO+qkSonO  +bO+qkSonO

[5 rows x 10 columns]

In [ ]:
df6.head(5)

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice     61  2012-05-08 23:01:28.0  ...     19e2e  +38u2u/rfx  +38u2u/rfx
1     sms      0  2012-05-08 23:01:31.0  ...     19e2e  +Fs4mTvdKx  +Fs4mTvdKx
2   Voice     10  2012-05-08 23:02:59.0  ...     19e2e  +ZaaZozy/+  +ZaaZozy/+
3     sms      0  2012-05-08 23:03:04.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4   Voice     22  2012-05-08 23:03:16.0  ...     19e2e  /eeMklgyJA  /eeMklgyJA

[5 rows x 10 columns]

In [ ]:
#concatinating the three Telcom datasets
telcom = pd.concat([df4, df5, df6])
telcom

     PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0      Voice      0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1        sms      0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
2        sms     25  2012-05-06 23:05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi
3      Voice     56  2012-05-06 23:05:42.0  ...     19e2e  +cNeJzsTp3  +cNeJzsTp3
4      Voice     14  2012-05-06 23:06:29.0  ...     19e2e  051KhYDCpv  051KhYDCpv
...      ...    ...                    ...  ...       ...         ...         ...
4996   Voice      0  2012-05-09 00:01:43.0  ...     19e2e  2aa04dcab7  f7d63a29e5
4997   Voice     62  2012-05-09 00:01:43.0  ...     19e2e  7f1f2f889f  b4ddb9e93c
4998   Voice     32  2012-05-09 00:01:43.0  ...     19e2e  a4731e780e  d68260ef50
4999   Voice     30  2012-05-09 00:01:43.0  ...     19e2e  98ed726da2  b4130b54ab
5000   Voice     60  2012-05-09 00:01:43.0  ...     19e2e  1c11a2fcbb  6d70dae094

[15003 rows x 10 columns]

In [ ]:
#checking shape of combined dataframe
telcom.shape

(15003, 10)

In [ ]:
#combined dataframe info
telcom.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 15003 entries, 0 to 5000
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   PRODUCT       15003 non-null  object
 1   VALUE         15003 non-null  int64
 2   DATE_TIME     15003 non-null  object
 3   CELL_ON_SITE  15003 non-null  object
 4   DW_A_NUMBER   15003 non-null  object
 5   DW_B_NUMBER   15003 non-null  object
 6   COUNTRY_A     15003 non-null  object
 7   COUNTRY_B     15003 non-null  object
 8   CELL_ID       15003 non-null  object
 9   SITE_ID       13006 non-null  object
dtypes: int64(1), object(9)
memory usage: 1.3+ MB

In [ ]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3974 entries, 0 to 3973
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Unnamed: 0    3974 non-null   int64
 1   VILLES        3974 non-null   object
 2   STATUS        3907 non-null   object
 3   LOCALISATION  3974 non-null   object
 4   DECOUPZONE    3974 non-null   object
 5   ZONENAME      3968 non-null   object
 6   LONGITUDE     3974 non-null   float64
 7   LATITUDE      3974 non-null   float64
 8   REGION        3974 non-null   object
 9   AREA          3951 non-null   object
 10  CELL_ID       3974 non-null   object
 11  SITE_CODE     3974 non-null   object
dtypes: float64(2), int64(1), object(9)
memory usage: 372.7+ KB

In [ ]:
#merged tables on cell_id column
merge = df2.merge(telcom, left_index= True, right_index = True)
merge.head(5)

   Unnamed: 0  VILLES      STATUS  ... COUNTRY_B   CELL_ID_y     SITE_ID
0           0  ADJAME  In Service  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
0           0  ADJAME  In Service  ...     19e2e  +854AcBQT2  +854AcBQT2
0           0  ADJAME  In Service  ...     19e2e  +38u2u/rfx  +38u2u/rfx
1           1  ADJAME  In Service  ...     19e2e  /+cKZKIp41  /+cKZKIp41
1           1  ADJAME  In Service  ...     19e2e  +854AcBQT2  +854AcBQT2

[5 rows x 22 columns]

In [ ]:
#Info on our columns
merge.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 11922 entries, 0 to 3973
Data columns (total 22 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Unnamed: 0    11922 non-null  int64
 1   VILLES        11922 non-null  object
 2   STATUS        11721 non-null  object
 3   LOCALISATION  11922 non-null  object
 4   DECOUPZONE    11922 non-null  object
 5   ZONENAME      11904 non-null  object
 6   LONGITUDE     11922 non-null  float64
 7   LATITUDE      11922 non-null  float64
 8   REGION        11922 non-null  object
 9   AREA          11853 non-null  object
 10  CELL_ID_x     11922 non-null  object
 11  SITE_CODE     11922 non-null  object
 12  PRODUCT       11922 non-null  object
 13  VALUE         11922 non-null  int64
 14  DATE_TIME     11922 non-null  object
 15  CELL_ON_SITE  11922 non-null  object
 16  DW_A_NUMBER   11922 non-null  object
 17  DW_B_NUMBER   11922 non-null  object
 18  COUNTRY_A     11922 non-null  object
 19  COUNTRY_B     11922 non-null  object
 20  CELL_ID_y     11922 non-null  object
 21  SITE_ID       10379 non-null  object
dtypes: float64(2), int64(2), object(18)
memory usage: 2.1+ MB

In [ ]:
#checking shape of our dataframe
merge.shape

(11922, 22)

In [ ]:
#dropping irrelevant columns
merge.drop(columns = ['COUNTRY_A','COUNTRY_B','CELL_ON_SITE','Unnamed: 0'], inplace=True)

In [ ]:
#checking shape of new dataframe and info
merge.info()
merge.shape

<class 'pandas.core.frame.DataFrame'>
Int64Index: 11922 entries, 0 to 3973
Data columns (total 18 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   VILLES        11922 non-null  object
 1   STATUS        11721 non-null  object
 2   LOCALISATION  11922 non-null  object
 3   DECOUPZONE    11922 non-null  object
 4   ZONENAME      11904 non-null  object
 5   LONGITUDE     11922 non-null  float64
 6   LATITUDE      11922 non-null  float64
 7   REGION        11922 non-null  object
 8   AREA          11853 non-null  object
 9   CELL_ID_x     11922 non-null  object
 10  SITE_CODE     11922 non-null  object
 11  PRODUCT       11922 non-null  object
 12  VALUE         11922 non-null  int64
 13  DATE_TIME     11922 non-null  object
 14  DW_A_NUMBER   11922 non-null  object
 15  DW_B_NUMBER   11922 non-null  object
 16  CELL_ID_y     11922 non-null  object
 17  SITE_ID       10379 non-null  object
dtypes: float64(2), int64(1), object(15)
memory usage: 1.7+ MB

(11922, 18)

In [ ]:
#checking for duplicates
merge.duplicated().unique()
#No duplicates

array([False])

In [ ]:
#checking for missing values
merge.isnull().sum()

VILLES             0
STATUS           201
LOCALISATION       0
DECOUPZONE         0
ZONENAME          18
LONGITUDE          0
LATITUDE           0
REGION             0
AREA              69
CELL_ID_x          0
SITE_CODE          0
PRODUCT            0
VALUE              0
DATE_TIME          0
DW_A_NUMBER        0
DW_B_NUMBER        0
CELL_ID_y          0
SITE_ID         1543
dtype: int64

In [ ]:
#dropping site id column. Too many nulls in the column
merge.drop(columns = ['SITE_ID'], inplace = True)

In [ ]:
#replacing all nulls with median values and checking lef nulls
merge.fillna(np.median, inplace = True)
merge.isnull().sum()

VILLES          0
STATUS          0
LOCALISATION    0
DECOUPZONE      0
ZONENAME        0
LONGITUDE       0
LATITUDE        0
REGION          0
AREA            0
CELL_ID_x       0
SITE_CODE       0
PRODUCT         0
VALUE           0
DATE_TIME       0
DW_A_NUMBER     0
DW_B_NUMBER     0
CELL_ID_y       0
dtype: int64

In [ ]:
#changing DATE_TIME column's datatype to datetime
merge.DATE_TIME = pd.to_datetime(merge.DATE_TIME)

In [ ]:
#confirming changed datatype
merge.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 11922 entries, 0 to 3973
Data columns (total 17 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   VILLES        11922 non-null  object
 1   STATUS        11922 non-null  object
 2   LOCALISATION  11922 non-null  object
 3   DECOUPZONE    11922 non-null  object
 4   ZONENAME      11922 non-null  object
 5   LONGITUDE     11922 non-null  float64
 6   LATITUDE      11922 non-null  float64
 7   REGION        11922 non-null  object
 8   AREA          11922 non-null  object
 9   CELL_ID_x     11922 non-null  object
 10  SITE_CODE     11922 non-null  object
 11  PRODUCT       11922 non-null  object
 12  VALUE         11922 non-null  int64
 13  DATE_TIME     11922 non-null  datetime64[ns]
 14  DW_A_NUMBER   11922 non-null  object
 15  DW_B_NUMBER   11922 non-null  object
 16  CELL_ID_y     11922 non-null  object
dtypes: datetime64[ns](1), float64(2), int64(1), object(13)
memory usage: 1.6+ MB

In [ ]:
#splitting datetime to get date and time separately
merge['date'] = [d.date() for d in merge.DATE_TIME]
merge['time'] = [d.time() for d in merge.DATE_TIME]
merge['date'] = pd.to_datetime(merge['date'])
merge['time'] = pd.to_datetime(merge['time'], format = '%H:%M%:%S:%f',errors='ignore')

In [ ]:
#checking datatype of date and time column
merge.dtypes

VILLES                  object
STATUS                  object
LOCALISATION            object
DECOUPZONE              object
ZONENAME                object
LONGITUDE              float64
LATITUDE               float64
REGION                  object
AREA                    object
CELL_ID_x               object
SITE_CODE               object
PRODUCT                 object
VALUE                    int64
DATE_TIME       datetime64[ns]
DW_A_NUMBER             object
DW_B_NUMBER             object
CELL_ID_y               object
date            datetime64[ns]
time                    object
dtype: object

## **ANALYSIS**

In [ ]:
#Which ones were the most used city for the three days?
merge.groupby(['date','VILLES']).size()

date        VILLES
2012-05-06  ABENGOUROU        21
            ABOBO            169
            ABOISSO           18
            ABOISSO COMOE      3
            ABONGOUA           3
                            ...
2012-05-09  ZATTA              3
            ZIKISSO            4
            ZON-HOUNIEN        3
            ZOUKOUGBEU         3
            ZUENOULA           9
Length: 1512, dtype: int64

In [ ]:
#Which ones were the most used city for the three days?
#optional approach
cities = merge.groupby('VILLES')
cities.first()

date        VILLES
2012-05-06  ABENGOUROU        21
            ABOBO            169
            ABOISSO           18
            ABOISSO COMOE      3
            ABONGOUA           3
                            ...
2012-05-09  ZATTA              3
            ZIKISSO            4
            ZON-HOUNIEN        3
            ZOUKOUGBEU         3
            ZUENOULA           9
Length: 1512, dtype: int64

In [ ]:
citiesl = cities.count()

In [ ]:
# sort the grouping count in descending to see cities that had the most cell ussage in the 3 days.
cities_li = citiesl.sort_values('CELL_ID_y', ascending = False)
#use head() to get the top 10 cities
cities_li.head(10)

              STATUS  LOCALISATION  DECOUPZONE  ...  CELL_ID_y  date  time
VILLES                                          ...
COCODY          1062          1062        1062  ...       1062  1062  1062
YOPOUGON         885           885         885  ...        885   885   885
ABOBO            765           765         765  ...        765   765   765
MARCORY          423           423         423  ...        423   423   423
TREICHVILLE      396           396         396  ...        396   396   396
ADJAME           330           330         330  ...        330   330   330
YAMOUSSOUKRO     312           312         312  ...        312   312   312
PLATEAU          309           309         309  ...        309   309   309
KOUMASSI         273           273         273  ...        273   273   273
BOUAKE           195           195         195  ...        195   195   195

[10 rows x 18 columns]

In [ ]:
#Which cities were the most used during business hours?
import datetime
#businesshours 9am to 5pm
bussinesshours = merge[((merge.DATE_TIME.dt.time>=datetime.time(9))& (merge.DATE_TIME.dt.time<=datetime.time(17)))]
#sorting the results
bussinesshours.groupby('VILLES')['VILLES'].count().sort_values(ascending = False)

Series([], Name: VILLES, dtype: int64)

In [ ]:
#Which cities were the most used during home hours?
import datetime

#home hours anything else not fitting under business hours
homehours = merge[~((merge.DATE_TIME.dt.time>=datetime.time(9))& (merge.DATE_TIME.dt.time<=datetime.time(17)))]
#sorting the results
homehours.groupby('VILLES')['VILLES'].count().sort_values(ascending = False)

VILLES
COCODY         1062
YOPOUGON        885
ABOBO           765
MARCORY         423
TREICHVILLE     396
               ...
LOUGBONON         9
MEMNI             6
KOTOULA           6
OUANGOLO          3
DANANON           3
Name: VILLES, Length: 504, dtype: int64

In [ ]:
#Most used city for the three days?
merge.groupby('VILLES')['VILLES'].count().sort_values(ascending=False)

VILLES
COCODY         1062
YOPOUGON        885
ABOBO           765
MARCORY         423
TREICHVILLE     396
               ...
LOUGBONON         9
MEMNI             6
KOTOULA           6
OUANGOLO          3
DANANON           3
Name: VILLES, Length: 504, dtype: int64

In [ ]:
#Which regions had most used product.Give the product
w =merge.groupby(['REGION','PRODUCT'])['PRODUCT'].count().sort_values(ascending = False)
w.head(5)

REGION         PRODUCT
LAGUNE         sms        2680
               Voice      2123
               data        747
BAS SASSANDRA  sms         331
               Voice       296
Name: PRODUCT, dtype: int64

In [ ]:
#which dates had most used product for the three days
merge.groupby(['date','PRODUCT'])['PRODUCT'].count().sort_values(ascending = False)

date        PRODUCT
2012-05-09  sms        1961
2012-05-07  sms        1745
2012-05-08  sms        1739
2012-05-07  Voice      1689
2012-05-08  Voice      1462
2012-05-09  Voice       944
2012-05-07  data        644
2012-05-08  data        598
2012-05-09  data        478
2012-05-06  Voice       302
            sms         270
            data         90
Name: PRODUCT, dtype: int64

In [ ]:
#Which area had the most used product the most and which product was it
merge.groupby(['AREA','PRODUCT'])['PRODUCT'].count().sort_values(ascending=False)

AREA                                 PRODUCT
ABIDJAN NORTH                        sms        1725
                                     Voice      1440
ABIDJAN SOUTH                        sms        1003
CENTRE NORTH                         sms         879
NORTH WEST                           sms         845
SOUTH WEST                           sms         767
ABIDJAN SOUTH                        Voice       701
CENTRE NORTH                         Voice       677
NORTH WEST                           Voice       606
SOUTH WEST                           Voice       566
ABIDJAN NORTH                        data        501
EAST                                 sms         458
                                     Voice       382
NORTH WEST                           data        298
CENTRE NORTH                         data        289
SOUTH WEST                           data        269
ABIDJAN SOUTH                        data        261
EAST                                 data        186
<function median at 0x7f1572513cb0>  sms          38
                                     Voice        25
                                     data          6
Name: PRODUCT, dtype: int64